Revit 2027 API
TableCellCombinedParameterData.ParamId Property
 The parameter id
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ParamId { get; set; }
Public Property ParamId As ElementId
	Get
	Set
public:
property ElementId^ ParamId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member ParamId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
TableCellCombinedParameterData Class
Autodesk.Revit.DB Namespace